// 2. Используя JavaScript, добавьте обработчик события изменения (change) для каждого элемента калькулятора:
// Создайте функцию calculatePrice(), которая будет вызываться при изменении любого элемента калькулятора
// В функции calculatePrice(), получите значения выбранных элементов (марка, модель, тип топлива, объем двигателя, состояние автомобиля, количество владельцев, способ оплаты)
// Используя полученные значения, расчетом определите стоимость автомобиля в зависимости от выбранных параметров
// Обновите отображение стоимости на странице

// 3. Улучшите калькулятор, добавив следующие функциональности:
// Динамическое обновление списка моделей автомобилей в зависимости от выбранной марки
// Установка предустановленных значений для некоторых элементов калькулятора
// Обработка ошибок и отображение соответствующих сообщений при некорректном вводе данных
// Анимация или изменение стиля элементов калькулятора при выборе определенных параметров
// Возможность сброса значений и стоимости автомобиля к исходным значениям